Revit 2027 API
ParameterTypeId.StructuralSectionShape Property
 "Section Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionShape { get; }
Public Shared ReadOnly Property StructuralSectionShape As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionShape {
	ForgeTypeId^ get ();
}
static member StructuralSectionShape : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace